---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IRevisionsOnSheetUIServer Methods
IRevisionsOnSheetUIServer Interface See Also Send Feedback
---

The IRevisionsOnSheetUIServer type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetDescription | Implement this method to return a description of the server.  (Inherited from IExternalServer.) |
|  | GetName | Implement this method to return the name of the server.  (Inherited from IExternalServer.) |
|  | GetServerId | Implement this method to return the id of the server.  (Inherited from IExternalServer.) |
|  | GetServiceId | Implement this method to return the id of the service.  (Inherited from IExternalServer.) |
|  | GetVendorId | Implement this method to return the id of the vendor of the server.  (Inherited from IExternalServer.) |
|  | ShowDialog | Shows dialog on managing RevisionsOnSheetUI. |

# See Also

IRevisionsOnSheetUIServer Interface

Autodesk.Revit.UI Namespace